sdaiCreateNestedAggrByIndexADB(Sdai_Id_aggr*,System.UInt32,Sdai_ADBId*)
\details
Creates a nested aggregate instance stored in an attribute data block
within a specified aggregate instance at the position specified by the index.
\param aggregate       [in] An aggregate instance that contains the created nested aggregate.
\param index           [in] An index that determines the position of the created item.
\param selaggrInstance [in] An attribute data block instance that defines the type of the SELECT value.
\returns The identifier of the newly created aggregate instance.
\code
SdaiADB lineIndex = sdaiCreateEmptyADB();
SdaiString  lineIndexPath[] = { "ifclineindex" };
sdaiPutADBTypePath(lineIndex, 1, lineIndexPath);
SdaiAggr lineIndexAggr = sdaiCreateNestedAggrByIndexADB(segments, 0, lineIndex);